# Pandas Tutorial

https://pandas.pydata.org/docs/user_guide/index.html

In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame(
    {
        "Name":[
            "Elisabeth Moss",
            "Harry Potter",
            "María del Carmen"
        ],
        "Age":[39, 36, 29],
        "Job":[
            "Carpintera y/o actriz",
            "Policía",
            "Agente de seguros"
        ]
    }
)

df

               Name  Age                    Job
0    Elisabeth Moss   39  Carpintera y/o actriz
1      Harry Potter   36                Policía
2  María del Carmen   29      Agente de seguros

## Objetos para la práctica

In [9]:
index = pd.date_range("1/1/2000", periods=8)
s = pd.Series(np.random.randn(5), index=["a", "b", "c", "d", "e"])
df = pd.DataFrame(np.random.randn(8, 3), index=index, columns=["A", "B", "C"])

In [5]:
df[:2]

                   A         B         C
2000-01-01  0.530829  1.944369  0.608425
2000-01-02 -0.668701  0.473511  0.883552

In [13]:
df.columns = [x.upper() for x in df.columns]
df

                   A         B         C
2000-01-01  0.731633 -0.052305 -2.003890
2000-01-02  1.944321 -1.862007 -0.213509
2000-01-03  1.454680  0.348702  1.745851
2000-01-04  0.418245 -1.442353  1.257154
2000-01-05  0.087344 -0.032946 -0.455651
2000-01-06  0.622011 -0.762723 -0.422182
2000-01-07  1.664165 -0.674914 -0.056170
2000-01-08 -1.273137 -0.836271  0.220819

In [5]:
np.random.randn(5)

array([-0.96884143,  0.82619645, -1.25542993,  0.65763142, -1.35102696])

In [14]:
ser = pd.Series(pd.date_range("2000", periods=2, tz="CET"))
ser

0   2000-01-01 00:00:00+01:00
1   2000-01-02 00:00:00+01:00
dtype: datetime64[ns, CET]

In [15]:
ser.to_numpy(dtype=object)

array([Timestamp('2000-01-01 00:00:00+0100', tz='CET'),
       Timestamp('2000-01-02 00:00:00+0100', tz='CET')], dtype=object)